class MovieIterator:    # собственный класс-итератор

    def __init__(self, movie_list): # конструктор, принимает исходный список фильмов
        self.movies = movie_list # сохраняем список фильмов внутри объекта
        self.index = 0 # счетчик (индекс) для отслеживания текущего элемента

    def __iter__(self): # метод, который делает объект итератором
        return self # возвращает сам объект-итератор

    def __next__(self): # метод для получения следующего элемента коллекции
        if self.index >= len(self.movies): # проверка, если индекс дошел до конца списка
            raise StopIteration  # cигнал, что элементы закончились
        result = self.movies[self.index] # берем текущий фильм из списка по индексу
        self.index += 1 # увеличиваем индекс на 1 для следующего шага
        return result # возвращаем найденный фильм наружу


def get_movies_by_year_generator(movie_list, target_year):  # ленивый генератор фильмов определенного года через yield 
    for m in movie_list: # бежим циклом по всем фильмам в списке
        if m.year == target_year: # если год фильма совпал с искомым годом
            yield m  # возвращает фильм по одному, экономия память компьютера
